#coding = utf-8

__author__ = "LT"
__title__ = "参数配置"
__desc__ = """我的模版全局参数配置与测试用例自定义参数配置模块"""

#---------------------------------全局参数----------------start------------------------------
# 数据库连接配置信息
mysql_config = {
    'host': '127.0.0.1',
    'port': 3306,
     # 数据库
    'database': 'uitest',
     # 用户名和密码
    'user': 'root',
    'password': '123456',
     # 数据库编码
    'charset': 'utf8'
}

#---------------------------------全局参数----------------start------------------------------
# 运行日志目录，自定义，如果路径为空:logDir = "",则默认使用IDE配置的参数，否则日志和报告自动生成到定义的目录下面
logDir='G:/ui-log'
# logDir = ""

# 启动模式  dev：指调试模式，启动时候从所有用例窗口启动 / prod: 指启动时候从start_run启动
start_model="prod"
#---------------------------------全局参数----------------start------------------------------

#---------------------------------用例业务参数------------end------------------------------
# 启动应用classify标识及环境选择
CLASSIFY = 'calc_app'

#测试用例个人性化参数自定义
case_01_params = {'name':'value'}

#---------------------------------用例业务参数------------end------------------------------